# Exploring the Raw Data

In [1]:
import pandas as pd
df = pd.read_csv("RawData_246F28274A7C_MAY_21.txt", delimiter = '\t')  #Importing Data
df.head()

   5/21/2021  08:25:00pm  1028  -996  11244  -485  -841  488
0  5/21/2021  08:25:00pm  1168 -1084  11248  -537  -740  488
1  5/21/2021  08:25:00pm  1020 -1084  11304  -503  -754  500
2  5/21/2021  08:25:00pm   968 -1100  11388  -402 -1029  482
3  5/21/2021  08:25:00pm   392 -1352  11828  -649  -476  486
4  5/21/2021  08:25:00pm   928 -1032  11316  -555  -686  495

In [2]:
j = 0
s = 'abcdefghi'                        # Rename each column name
for i in df.columns:
    df.rename(columns = {i: s[j]}, inplace = True)
    j += 1

In [3]:
df

                a           b     c     d      e    f     g    h
0       5/21/2021  08:25:00pm  1168 -1084  11248 -537  -740  488
1       5/21/2021  08:25:00pm  1020 -1084  11304 -503  -754  500
2       5/21/2021  08:25:00pm   968 -1100  11388 -402 -1029  482
3       5/21/2021  08:25:00pm   392 -1352  11828 -649  -476  486
4       5/21/2021  08:25:00pm   928 -1032  11316 -555  -686  495
...           ...         ...   ...   ...    ...  ...   ...  ...
257993  5/21/2021  11:58:53pm  1000 -1096  11372 -591  -681  454
257994  5/21/2021  11:58:53pm  1020 -1116  11412 -582  -691  479
257995  5/21/2021  11:58:53pm  1120 -1132  11532 -567  -708  493
257996  5/21/2021  11:58:53pm  1004  -988  11320 -593  -718  477
257997  5/21/2021  11:58:53pm   912 -1052  11356 -584  -727  471

[257998 rows x 8 columns]

Attributes of Data:

In [4]:
df.index    # To get the index(row) labels of dataframes

RangeIndex(start=0, stop=257998, step=1)

In [5]:
df.columns  # To get the column labels of the dataframes

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'], dtype='object')

In [6]:
row, col = df.shape # To get the dimensionality of the dataframe
print(row, col)

257998 8

In [7]:
df.size  # To get the total number of elements from the dataframe

2063984

In [8]:
df.memory_usage() # The memory usage of each column in bytes

Index        128
a        2063984
b        2063984
c        2063984
d        2063984
e        2063984
f        2063984
g        2063984
h        2063984
dtype: int64

In [9]:
df.ndim  # The no. of axes/array dimensions

2

Indexing & Selecting the data:

In [10]:
df.head(3)  # returns the first 3 rows from the dataframes

           a           b     c     d      e    f     g    h
0  5/21/2021  08:25:00pm  1168 -1084  11248 -537  -740  488
1  5/21/2021  08:25:00pm  1020 -1084  11304 -503  -754  500
2  5/21/2021  08:25:00pm   968 -1100  11388 -402 -1029  482

In [11]:
df.tail(5)  # returns the last 5 rows from the dataframes

                a           b     c     d      e    f    g    h
257993  5/21/2021  11:58:53pm  1000 -1096  11372 -591 -681  454
257994  5/21/2021  11:58:53pm  1020 -1116  11412 -582 -691  479
257995  5/21/2021  11:58:53pm  1120 -1132  11532 -567 -708  493
257996  5/21/2021  11:58:53pm  1004  -988  11320 -593 -718  477
257997  5/21/2021  11:58:53pm   912 -1052  11356 -584 -727  471

DataTypes:

In [12]:
df.dtypes  # Returns a series with the dataType of each column

a    object
b    object
c     int64
d     int64
e     int64
f     int64
g     int64
h     int64
dtype: object

In [13]:
df.dtypes.value_counts()  # Returns counts of unique DataType in the dataframe

int64     6
object    2
dtype: int64

In [14]:
df.select_dtypes(exclude = [object])  # Returns a subsets of the columns from dataframe based on the col's datatype

           c     d      e    f     g    h
0       1168 -1084  11248 -537  -740  488
1       1020 -1084  11304 -503  -754  500
2        968 -1100  11388 -402 -1029  482
3        392 -1352  11828 -649  -476  486
4        928 -1032  11316 -555  -686  495
...      ...   ...    ...  ...   ...  ...
257993  1000 -1096  11372 -591  -681  454
257994  1020 -1116  11412 -582  -691  479
257995  1120 -1132  11532 -567  -708  493
257996  1004  -988  11320 -593  -718  477
257997   912 -1052  11356 -584  -727  471

[257998 rows x 6 columns]

In [15]:
df.select_dtypes(include = [object])

                a           b
0       5/21/2021  08:25:00pm
1       5/21/2021  08:25:00pm
2       5/21/2021  08:25:00pm
3       5/21/2021  08:25:00pm
4       5/21/2021  08:25:00pm
...           ...         ...
257993  5/21/2021  11:58:53pm
257994  5/21/2021  11:58:53pm
257995  5/21/2021  11:58:53pm
257996  5/21/2021  11:58:53pm
257997  5/21/2021  11:58:53pm

[257998 rows x 2 columns]

In [16]:
df.info() # Returns a concise summary of a dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 257998 entries, 0 to 257997
Data columns (total 8 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   a       257998 non-null  object
 1   b       257998 non-null  object
 2   c       257998 non-null  int64
 3   d       257998 non-null  int64
 4   e       257998 non-null  int64
 5   f       257998 non-null  int64
 6   g       257998 non-null  int64
 7   h       257998 non-null  int64
dtypes: int64(6), object(2)
memory usage: 15.7+ MB